model:
  type: 'VINet'
  backbone:
    type: 'VEBackbone'
    config:
      input_dimension: 3
      structure:
        [[-1, 1, Conv, [64, 3, 1, 1, 1, True, True, 'ReLU-inplace']],
         [-1, 1, MaxPool, [2, 2]],
         [-1, 1, Conv, [128, 3, 1, 1, 1, True, True, 'ReLU-inplace']],
         [-1, 1, MaxPool, [2, 2]],
         [-1, 1, ResBlock, [256, 3]],
         [-1, 1, Conv, [256, 3, 1, 1, 1, True, True, 'ReLU-inplace']],
         [-1, 1, MaxPool, [2, 2]],
         [-1, 1, ResBlock, [512, 4]],
         [-1, 1, Conv, [512, 3, 1, 1, 1, True, True, 'ReLU-inplace']]
        ]
        
